# TfDashMPerM Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..TfDashMPerM Property
SymbolTypeId Class See Also
---
Symbol Tf-m/m, indicating unit Tonne force meters per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId TfDashMPerM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TfDashMPerM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TfDashMPerM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace